tests/UseCase/Expense/fixtures/list.json

[
  {
    "Expense": {
      "id": "91",
      "user_id": "1",
      "user_profile_id": "2",
      "client_id": "2",
      "expense_category_id": null,
      "sequence_id": "18",
      "number": "2023050",
      "type": "invoice",
      "name": "SuperFaktura.sk - Polročné prémiové členstvo",
      "variable": "122",
      "constant": "0308",
      "specific": null,
      "amount2": null,
      "vat2": null,
      "amount3": null,
      "vat3": null,
      "exchange_rate": "1.00000000000000",
      "country_exchange_rate": "1.00000000000000",
      "created": "2023-10-11 00:00:00",
      "delivery": "2023-10-11 00:00:00",
      "due": "2023-10-11 00:00:00",
      "paydate": "2023-10-11",
      "paid": 68.37,
      "paid_vat": 68.37,
      "amount_paid": 56.97,
      "amount_paid_vat": 68.37,
      "status": "2",
      "amount": 113.9417,
      "amount_home": "56.9800",
      "amount_country_home": "56.9800",
      "vat": 20,
      "tax": "20.00",
      "total": "68.3800",
      "total_home": "68.3800",
      "total_country_home": "68.3800",
      "discount": "0",
      "discount_total": "0.0000",
      "currency": "EUR",
      "home_currency": "EUR",
      "comment": null,
      "client_data": "{\"id\":2,\"user_id\":1,\"user_profile_id\":2,\"uuid\":null,\"country_id\":191,\"name\":\"SuperFaktura, s.r.o.\",\"ico\":\"46655034\",\"dic\":\"2023513470\",\"ic_dph\":\"SK2023513470\",\"account\":null,\"email\":\"joe.doe@superfaktura.sk\",\"address\":\"Pri Suchom mlyne 6\",\"city\":\"Bratislava - mestsk\\u00e1 \\u010das\\u0165 Star\\u00e9 Mesto\",\"zip\":\"811 04\",\"state\":\"\",\"country\":\"Slovensko\",\"delivery_name\":\"\",\"delivery_address\":\"\",\"delivery_city\":\"\",\"delivery_zip\":\"\",\"delivery_state\":\"\",\"delivery_country\":\"Slovensko\",\"delivery_country_id\":191,\"phone\":null,\"delivery_phone\":\"\",\"fax\":\"\",\"due_date\":null,\"default_variable\":\"\",\"discount\":null,\"currency\":null,\"bank_account_id\":0,\"comment\":\"\",\"tags\":null,\"distance\":0,\"dont_travel\":null,\"notices\":true}",
      "my_data": "",
      "modified": "2023-10-11 07:21:30",
      "recurring": null,
      "taxdate": "2023-10-11",
      "accounting_date": "2023-10-11",
      "taxable_supply": null,
      "demo": "0",
      "tags": null,
      "document_number": "2023017",
      "expense_no": "50",
      "tax_code": null,
      "version": "items",
      "rates": {
        "20": {
          "base": "56.98",
          "vat": "11.40"
        }
      },
      "flag": "partially-due",
      "qr": "",
      "qr_url": "",
      "qr_url_max": "",
      "qr_type": "",
      "missing_bank_account": true,
      "is_payable_by_tatrabanka": false
    },
    "ExpenseItem": [
      {
        "id": "102",
        "type": "item",
        "name": "SuperFaktura.sk - Prémiový balík služieb ",
        "description": "6 mesiacov: 12.12.2026 - 11.06.2027",
        "quantity": "1.00000",
        "unit": null,
        "unit_price": "113.9417",
        "tax": "20.00",
        "unit_total": "136.7300",
        "total": "136.7300",
        "stock_item_id": null,
        "discount": "50.00000",
        "discount_description": "Zľava 50%",
        "ordernum": "0"
      }
    ],
    "Document": [
      {
        "Document": {
          "id": "70",
          "model": "Expense",
          "foreign_key": "91",
          "dirname": "doc",
          "basename": "b133a22fdb6f2dd2d393_296_5d9ba69a457a8466d42966393291279e.pdf",
          "checksum": "a69e9aeac79ea6d7dd51c5b772f37e48",
          "group": "document",
          "default": false,
          "alternative": "2023017.pdf",
          "size": 131154,
          "extern_file": "0",
          "delete_flag": false,
          "created": "2023-10-11 07:21:30",
          "modified": "2023-10-11 07:21:30",
          "path": "expenses\/openAttachment\/91\/70\/2023017.pdf",
          "file": "\/var\/www\/superfaktura\/app\/webroot\/media\/transfer\/doc\/b133a22fdb6f2dd2d393_296_5d9ba69a457a8466d42966393291279e.pdf",
          "mime_type": "application\/pdf",
          "preview": false
        }
      }
    ],
    "ExpensePayment": [
      {
        "id": "71",
        "expense_id": "91",
        "user_id": "1",
        "user_profile_id": "2",
        "force_paid": "0",
        "payment_type": "transfer",
        "amount": "56.9700",
        "amount_home": "56.9700",
        "amount_country_home": "56.9700",
        "amount_expense": "56.9700",
        "vat": "11.4000",
        "total": "68.3700",
        "total_home": "68.3700",
        "total_country_home": "68.3700",
        "total_expense": "68.3700",
        "currency": "EUR",
        "country_exchange_rate": "1.00000000000000",
        "exchange_rate": "1.00000000000000",
        "expense_exchange_rate": "1.00000000000000",
        "document_no": "",
        "created": "2023-10-11 07:21:30"
      }
    ],
    "CashRegisterItem": [],
    "Client": {
      "id": "2",
      "user_id": 1,
      "user_profile_id": 2,
      "uuid": null,
      "country_id": 191,
      "name": "SuperFaktura, s.r.o.",
      "ico": "46655034",
      "dic": "2023513470",
      "ic_dph": "SK2023513470",
      "account": null,
      "email": "joe.doe@superfaktura.sk",
      "address": "Pri Suchom mlyne 6",
      "city": "Bratislava - mestská časť Staré Mesto",
      "zip": "811 04",
      "state": "",
      "country": "Slovensko",
      "delivery_name": "",
      "delivery_address": "",
      "delivery_city": "",
      "delivery_zip": "",
      "delivery_state": "",
      "delivery_country": "Slovensko",
      "delivery_country_id": 191,
      "phone": null,
      "delivery_phone": "",
      "fax": "",
      "due_date": null,
      "default_variable": "",
      "discount": null,
      "currency": null,
      "bank_account_id": 0,
      "comment": "",
      "tags": null,
      "distance": 0,
      "dont_travel": null,
      "notices": true,
      "bank_account_prefix": "",
      "bank_account": null,
      "bank_code": null,
      "iban": null,
      "swift": null
    },
    "Tag": [],
    "MyData": {
      "id": "2",
      "user_id": "1",
      "country_id": "191",
      "company_name": "SuperFaktura s.r.o.",
      "name": null,
      "ico": "46655034",
      "dic": "2023513470",
      "ic_dph": "SK2023513470",
      "business_register": "Obchodný register Mestského súdu Bratislava III, oddiel: Sro, vložka č. 81403\/B",
      "address": "Pri Suchom mlyne 6",
      "city": "Bratislava - mestská časť Staré Mesto",
      "zip": "811 04",
      "tax_payer": "1",
      "vat_interval": null,
      "company_type": "ltd"
    },
    "RelatedItem": [],
    "VatSummary": {
      "20": {
        "base": 56.98,
        "vat": 11.4
      }
    },
    "ExpenseExtra": [],
    "ClientStat": {
      "risk": "0"
    },
    "attachments": [
      {
        "url": {
          "id": "70",
          "name": "2023017.pdf",
          "src": false,
          "width": 0,
          "height": 0
        }
      }
    ]
  },
  {
    "Expense": {
      "id": "90",
      "user_id": "1",
      "user_profile_id": "2",
      "client_id": "2",
      "expense_category_id": null,
      "sequence_id": "18",
      "number": "2023049",
      "type": "invoice",
      "name": "SuperFaktura.sk - Mesačné prémiové členstvo",
      "variable": "121",
      "constant": "0308",
      "specific": null,
      "amount2": null,
      "vat2": null,
      "amount3": null,
      "vat3": null,
      "exchange_rate": "1.00000000000000",
      "country_exchange_rate": "1.00000000000000",
      "created": "2023-10-09 00:00:00",
      "delivery": "2023-10-09 00:00:00",
      "due": "2023-10-09 00:00:00",
      "paydate": "2023-10-09",
      "paid": 12,
      "paid_vat": 12,
      "amount_paid": 10,
      "amount_paid_vat": 12,
      "status": "3",
      "amount": 19.9917,
      "amount_home": "10.0000",
      "amount_country_home": "10.0000",
      "vat": 20,
      "tax": "20.00",
      "total": "12.0000",
      "total_home": "12.0000",
      "total_country_home": "12.0000",
      "discount": "0",
      "discount_total": "0.0000",
      "currency": "EUR",
      "home_currency": "EUR",
      "comment": null,
      "client_data": "{\"id\":2,\"user_id\":1,\"user_profile_id\":2,\"uuid\":null,\"country_id\":191,\"name\":\"SuperFaktura, s.r.o.\",\"ico\":\"46655034\",\"dic\":\"2023513470\",\"ic_dph\":\"SK2023513470\",\"account\":null,\"email\":\"joe.doe@superfaktura.sk\",\"address\":\"Pri Suchom mlyne 6\",\"city\":\"Bratislava - mestsk\\u00e1 \\u010das\\u0165 Star\\u00e9 Mesto\",\"zip\":\"811 04\",\"state\":\"\",\"country\":\"Slovensko\",\"delivery_name\":\"\",\"delivery_address\":\"\",\"delivery_city\":\"\",\"delivery_zip\":\"\",\"delivery_state\":\"\",\"delivery_country\":\"Slovensko\",\"delivery_country_id\":191,\"phone\":null,\"delivery_phone\":\"\",\"fax\":\"\",\"due_date\":null,\"default_variable\":\"\",\"discount\":null,\"currency\":null,\"bank_account_id\":0,\"comment\":\"\",\"tags\":null,\"distance\":0,\"dont_travel\":null,\"notices\":true}",
      "my_data": "",
      "modified": "2023-10-09 11:43:30",
      "recurring": null,
      "taxdate": "2023-10-09",
      "accounting_date": "2023-10-09",
      "taxable_supply": null,
      "demo": "0",
      "tags": null,
      "document_number": "2023016",
      "expense_no": "49",
      "tax_code": null,
      "version": "items",
      "rates": {
        "20": {
          "base": "10.00",
          "vat": "2.00"
        }
      },
      "flag": "fully-paid",
      "qr": "",
      "qr_url": "",
      "qr_url_max": "",
      "qr_type": "",
      "missing_bank_account": true,
      "is_payable_by_tatrabanka": false
    },
    "ExpenseItem": [
      {
        "id": "101",
        "type": "item",
        "name": "SuperFaktura.sk - Prémiový balík služieb ",
        "description": "1 mesiac: 12.11.2026 - 11.12.2026",
        "quantity": "1.00000",
        "unit": null,
        "unit_price": "19.9917",
        "tax": "20.00",
        "unit_total": "23.9900",
        "total": "23.9900",
        "stock_item_id": null,
        "discount": "50.00000",
        "discount_description": "Zľava 50%",
        "ordernum": "0"
      }
    ],
    "Document": [
      {
        "Document": {
          "id": "69",
          "model": "Expense",
          "foreign_key": "90",
          "dirname": "doc",
          "basename": "ba71ebb7215e2d2de8a7_294_1bbd5d35153264aa0431e6a1df18b5e8.pdf",
          "checksum": "4e36b5b33144398b7d25e87d50141791",
          "group": "document",
          "default": false,
          "alternative": "2023016.pdf",
          "size": 131220,
          "extern_file": "0",
          "delete_flag": false,
          "created": "2023-10-09 11:43:30",
          "modified": "2023-10-09 11:43:30",
          "path": "expenses\/openAttachment\/90\/69\/2023016.pdf",
          "file": "\/var\/www\/superfaktura\/app\/webroot\/media\/transfer\/doc\/ba71ebb7215e2d2de8a7_294_1bbd5d35153264aa0431e6a1df18b5e8.pdf",
          "mime_type": "application\/pdf",
          "preview": false
        }
      }
    ],
    "ExpensePayment": [
      {
        "id": "70",
        "expense_id": "90",
        "user_id": "1",
        "user_profile_id": "2",
        "force_paid": "0",
        "payment_type": "transfer",
        "amount": "10.0000",
        "amount_home": "10.0000",
        "amount_country_home": "10.0000",
        "amount_expense": "10.0000",
        "vat": "2.0000",
        "total": "12.0000",
        "total_home": "12.0000",
        "total_country_home": "12.0000",
        "total_expense": "12.0000",
        "currency": "EUR",
        "country_exchange_rate": "1.00000000000000",
        "exchange_rate": "1.00000000000000",
        "expense_exchange_rate": "1.00000000000000",
        "document_no": "",
        "created": "2023-10-09 11:43:30"
      }
    ],
    "CashRegisterItem": [],
    "Client": {
      "id": "2",
      "user_id": 1,
      "user_profile_id": 2,
      "uuid": null,
      "country_id": 191,
      "name": "SuperFaktura, s.r.o.",
      "ico": "46655034",
      "dic": "2023513470",
      "ic_dph": "SK2023513470",
      "account": null,
      "email": "joe.doe@superfaktura.sk",
      "address": "Pri Suchom mlyne 6",
      "city": "Bratislava - mestská časť Staré Mesto",
      "zip": "811 04",
      "state": "",
      "country": "Slovensko",
      "delivery_name": "",
      "delivery_address": "",
      "delivery_city": "",
      "delivery_zip": "",
      "delivery_state": "",
      "delivery_country": "Slovensko",
      "delivery_country_id": 191,
      "phone": null,
      "delivery_phone": "",
      "fax": "",
      "due_date": null,
      "default_variable": "",
      "discount": null,
      "currency": null,
      "bank_account_id": 0,
      "comment": "",
      "tags": null,
      "distance": 0,
      "dont_travel": null,
      "notices": true,
      "bank_account_prefix": "",
      "bank_account": null,
      "bank_code": null,
      "iban": null,
      "swift": null
    },
    "Tag": [],
    "MyData": {
      "id": "2",
      "user_id": "1",
      "country_id": "191",
      "company_name": "SuperFaktura s.r.o.",
      "name": null,
      "ico": "46655034",
      "dic": "2023513470",
      "ic_dph": "SK2023513470",
      "business_register": "Obchodný register Mestského súdu Bratislava III, oddiel: Sro, vložka č. 81403\/B",
      "address": "Pri Suchom mlyne 6",
      "city": "Bratislava - mestská časť Staré Mesto",
      "zip": "811 04",
      "tax_payer": "1",
      "vat_interval": null,
      "company_type": "ltd"
    },
    "RelatedItem": [],
    "VatSummary": {
      "20": {
        "base": 10,
        "vat": 2
      }
    },
    "ExpenseExtra": [],
    "ClientStat": {
      "risk": "0"
    },
    "attachments": [
      {
        "url": {
          "id": "69",
          "name": "2023016.pdf",
          "src": false,
          "width": 0,
          "height": 0
        }
      }
    ]
  }
]
